package Forest;

/*
    В java-файле д/б хотя бы один публичный файл и имя файла должно совпадать с именем этого
    публичного класса.
    Класс м/б либо публичным, либо default. Private и Protected для классов не имеют смысла.
    В одном java-файле м/б только один публичный файл.

    Default - метод, поле - доступны в пакете
    Protected - ... доступны в пакете и во всех классах-наследниках
    Private - ... доступны внутри класса
    Public - ... доступны без ограничений
 */

 /*
    SH:  В Java мы не можем сформировать данные вне классов, т.е. все данные описываются внутри
    класса, в отличие от Паскаля или C.
  */
public class Tree {
}
